Ran Plan for project: `S3` dir: `workspaces/851725403398/ap-southeast-1` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.this must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::phongvupham-unique-name-161618122024" -> (known after apply)
      ~ bucket                      = "phongvupham-unique-name-161618122024" -> "phongvupham-unique-S3-name-084619122024" # forces replacement
      ~ bucket_domain_name          = "phongvupham-unique-name-161618122024.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "phongvupham-unique-name-161618122024.s3.ap-southeast-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3O0J2DXBE1FTB" -> (known after apply)
      ~ id                          = "phongvupham-unique-name-161618122024" -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "dev"
            "Project"     = "MyS3BucketProject"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "95eaf84498a55ed4c1efa0f84a134a2edc0f963877cef87d5aef1e83dac49e4b" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # aws_s3_bucket_acl.this must be replaced
-/+ resource "aws_s3_bucket_acl" "this" {
      ~ bucket                = "phongvupham-unique-name-161618122024" -> (known after apply) # forces replacement
      ~ id                    = "phongvupham-unique-name-161618122024,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name  = "phongvupham1110" -> null
                  - id            = "95eaf84498a55ed4c1efa0f84a134a2edc0f963877cef87d5aef1e83dac49e4b" -> null
                  - type          = "CanonicalUser" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - owner {
              - display_name = "phongvupham1110" -> null
              - id           = "95eaf84498a55ed4c1efa0f84a134a2edc0f963877cef87d5aef1e83dac49e4b" -> null
            }
        }
    }

  # aws_s3_bucket_ownership_controls.this must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "this" {
      ~ bucket = "phongvupham-unique-name-161618122024" -> (known after apply) # forces replacement
      ~ id     = "phongvupham-unique-name-161618122024" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "phongvupham-unique-name-161618122024" -> (known after apply) # forces replacement
      ~ id                      = "phongvupham-unique-name-161618122024" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_versioning.versioning must be replaced
-/+ resource "aws_s3_bucket_versioning" "versioning" {
      ~ bucket                = "phongvupham-unique-name-161618122024" -> (known after apply) # forces replacement
      ~ id                    = "phongvupham-unique-name-161618122024" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 5 to add, 0 to change, 5 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p S3
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://534d39a5cd57:4141/lock?id=PhongPhamj%252Frun-atlantis-demo%252Fworkspaces%252F851725403398%252Fap-southeast-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p S3
  ```
Plan: 5 to add, 0 to change, 5 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```